flit/argon-rtos/test/kinetis/devices/MKL28T7/MKL28T7_CORE0.h
/* The count of MSCM_CP0CFG1 */
#define MSCM_CP0CFG1_COUNT                       (1U)

/*! @name CP0CFG2 - Processor 0 Configuration Register */
#define MSCM_CP0CFG2_DCWY_MASK                   (0xFFU)
#define MSCM_CP0CFG2_DCWY_SHIFT                  (0U)
#define MSCM_CP0CFG2_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_DCWY_SHIFT)) & MSCM_CP0CFG2_DCWY_MASK)
#define MSCM_CP0CFG2_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP0CFG2_DCSZ_SHIFT                  (8U)
#define MSCM_CP0CFG2_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_DCSZ_SHIFT)) & MSCM_CP0CFG2_DCSZ_MASK)
#define MSCM_CP0CFG2_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP0CFG2_ICWY_SHIFT                  (16U)
#define MSCM_CP0CFG2_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_ICWY_SHIFT)) & MSCM_CP0CFG2_ICWY_MASK)
#define MSCM_CP0CFG2_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP0CFG2_ICSZ_SHIFT                  (24U)
#define MSCM_CP0CFG2_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_ICSZ_SHIFT)) & MSCM_CP0CFG2_ICSZ_MASK)

/* The count of MSCM_CP0CFG2 */
#define MSCM_CP0CFG2_COUNT                       (1U)

/*! @name CP0CFG3 - Processor 0 Configuration Register */
#define MSCM_CP0CFG3_DCWY_MASK                   (0xFFU)
#define MSCM_CP0CFG3_DCWY_SHIFT                  (0U)
#define MSCM_CP0CFG3_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_DCWY_SHIFT)) & MSCM_CP0CFG3_DCWY_MASK)
#define MSCM_CP0CFG3_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP0CFG3_DCSZ_SHIFT                  (8U)
#define MSCM_CP0CFG3_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_DCSZ_SHIFT)) & MSCM_CP0CFG3_DCSZ_MASK)
#define MSCM_CP0CFG3_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP0CFG3_ICWY_SHIFT                  (16U)
#define MSCM_CP0CFG3_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_ICWY_SHIFT)) & MSCM_CP0CFG3_ICWY_MASK)
#define MSCM_CP0CFG3_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP0CFG3_ICSZ_SHIFT                  (24U)
#define MSCM_CP0CFG3_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_ICSZ_SHIFT)) & MSCM_CP0CFG3_ICSZ_MASK)

/* The count of MSCM_CP0CFG3 */
#define MSCM_CP0CFG3_COUNT                       (1U)

/*! @name CP1TYPE - Processor 1 Type Register */
#define MSCM_CP1TYPE_RYPZ_MASK                   (0xFFU)
#define MSCM_CP1TYPE_RYPZ_SHIFT                  (0U)
#define MSCM_CP1TYPE_RYPZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1TYPE_RYPZ_SHIFT)) & MSCM_CP1TYPE_RYPZ_MASK)
#define MSCM_CP1TYPE_PERSONALITY_MASK            (0xFFFFFF00U)
#define MSCM_CP1TYPE_PERSONALITY_SHIFT           (8U)
#define MSCM_CP1TYPE_PERSONALITY(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_CP1TYPE_PERSONALITY_SHIFT)) & MSCM_CP1TYPE_PERSONALITY_MASK)

/*! @name CP1NUM - Processor 1 Number Register */
#define MSCM_CP1NUM_CPN_MASK                     (0x1U)
#define MSCM_CP1NUM_CPN_SHIFT                    (0U)
#define MSCM_CP1NUM_CPN(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_CP1NUM_CPN_SHIFT)) & MSCM_CP1NUM_CPN_MASK)

/*! @name CP1MASTER - Processor 1 Master Register */
#define MSCM_CP1MASTER_PPN_MASK                  (0x3FU)
#define MSCM_CP1MASTER_PPN_SHIFT                 (0U)
#define MSCM_CP1MASTER_PPN(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_CP1MASTER_PPN_SHIFT)) & MSCM_CP1MASTER_PPN_MASK)

/*! @name CP1COUNT - Processor 1 Count Register */
#define MSCM_CP1COUNT_PCNT_MASK                  (0x3U)
#define MSCM_CP1COUNT_PCNT_SHIFT                 (0U)
#define MSCM_CP1COUNT_PCNT(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_CP1COUNT_PCNT_SHIFT)) & MSCM_CP1COUNT_PCNT_MASK)

/*! @name CP1CFG0 - Processor 1 Configuration Register */
#define MSCM_CP1CFG0_DCWY_MASK                   (0xFFU)
#define MSCM_CP1CFG0_DCWY_SHIFT                  (0U)
#define MSCM_CP1CFG0_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG0_DCWY_SHIFT)) & MSCM_CP1CFG0_DCWY_MASK)
#define MSCM_CP1CFG0_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP1CFG0_DCSZ_SHIFT                  (8U)
#define MSCM_CP1CFG0_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG0_DCSZ_SHIFT)) & MSCM_CP1CFG0_DCSZ_MASK)
#define MSCM_CP1CFG0_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP1CFG0_ICWY_SHIFT                  (16U)
#define MSCM_CP1CFG0_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG0_ICWY_SHIFT)) & MSCM_CP1CFG0_ICWY_MASK)
#define MSCM_CP1CFG0_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP1CFG0_ICSZ_SHIFT                  (24U)
#define MSCM_CP1CFG0_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG0_ICSZ_SHIFT)) & MSCM_CP1CFG0_ICSZ_MASK)

/* The count of MSCM_CP1CFG0 */
#define MSCM_CP1CFG0_COUNT                       (1U)

/*! @name CP1CFG1 - Processor 1 Configuration Register */
#define MSCM_CP1CFG1_DCWY_MASK                   (0xFFU)
#define MSCM_CP1CFG1_DCWY_SHIFT                  (0U)
#define MSCM_CP1CFG1_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG1_DCWY_SHIFT)) & MSCM_CP1CFG1_DCWY_MASK)
#define MSCM_CP1CFG1_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP1CFG1_DCSZ_SHIFT                  (8U)
#define MSCM_CP1CFG1_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG1_DCSZ_SHIFT)) & MSCM_CP1CFG1_DCSZ_MASK)
#define MSCM_CP1CFG1_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP1CFG1_ICWY_SHIFT                  (16U)
#define MSCM_CP1CFG1_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG1_ICWY_SHIFT)) & MSCM_CP1CFG1_ICWY_MASK)
#define MSCM_CP1CFG1_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP1CFG1_ICSZ_SHIFT                  (24U)
#define MSCM_CP1CFG1_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG1_ICSZ_SHIFT)) & MSCM_CP1CFG1_ICSZ_MASK)

/* The count of MSCM_CP1CFG1 */
#define MSCM_CP1CFG1_COUNT                       (1U)

