flit/argon-rtos/test/kinetis/devices/MKL28T7/MKL28T7_CORE0.h
/*! @name CP1CFG2 - Processor 1 Configuration Register */
#define MSCM_CP1CFG2_DCWY_MASK                   (0xFFU)
#define MSCM_CP1CFG2_DCWY_SHIFT                  (0U)
#define MSCM_CP1CFG2_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG2_DCWY_SHIFT)) & MSCM_CP1CFG2_DCWY_MASK)
#define MSCM_CP1CFG2_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP1CFG2_DCSZ_SHIFT                  (8U)
#define MSCM_CP1CFG2_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG2_DCSZ_SHIFT)) & MSCM_CP1CFG2_DCSZ_MASK)
#define MSCM_CP1CFG2_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP1CFG2_ICWY_SHIFT                  (16U)
#define MSCM_CP1CFG2_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG2_ICWY_SHIFT)) & MSCM_CP1CFG2_ICWY_MASK)
#define MSCM_CP1CFG2_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP1CFG2_ICSZ_SHIFT                  (24U)
#define MSCM_CP1CFG2_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG2_ICSZ_SHIFT)) & MSCM_CP1CFG2_ICSZ_MASK)

/* The count of MSCM_CP1CFG2 */
#define MSCM_CP1CFG2_COUNT                       (1U)

/*! @name CP1CFG3 - Processor 1 Configuration Register */
#define MSCM_CP1CFG3_DCWY_MASK                   (0xFFU)
#define MSCM_CP1CFG3_DCWY_SHIFT                  (0U)
#define MSCM_CP1CFG3_DCWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG3_DCWY_SHIFT)) & MSCM_CP1CFG3_DCWY_MASK)
#define MSCM_CP1CFG3_DCSZ_MASK                   (0xFF00U)
#define MSCM_CP1CFG3_DCSZ_SHIFT                  (8U)
#define MSCM_CP1CFG3_DCSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG3_DCSZ_SHIFT)) & MSCM_CP1CFG3_DCSZ_MASK)
#define MSCM_CP1CFG3_ICWY_MASK                   (0xFF0000U)
#define MSCM_CP1CFG3_ICWY_SHIFT                  (16U)
#define MSCM_CP1CFG3_ICWY(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG3_ICWY_SHIFT)) & MSCM_CP1CFG3_ICWY_MASK)
#define MSCM_CP1CFG3_ICSZ_MASK                   (0xFF000000U)
#define MSCM_CP1CFG3_ICSZ_SHIFT                  (24U)
#define MSCM_CP1CFG3_ICSZ(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_CP1CFG3_ICSZ_SHIFT)) & MSCM_CP1CFG3_ICSZ_MASK)

/* The count of MSCM_CP1CFG3 */
#define MSCM_CP1CFG3_COUNT                       (1U)

/*! @name OCMDR - On-Chip Memory Descriptor Register */
#define MSCM_OCMDR_OCMPU_MASK                    (0x1000U)
#define MSCM_OCMDR_OCMPU_SHIFT                   (12U)
#define MSCM_OCMDR_OCMPU(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMPU_SHIFT)) & MSCM_OCMDR_OCMPU_MASK)
#define MSCM_OCMDR_OCMT_MASK                     (0xE000U)
#define MSCM_OCMDR_OCMT_SHIFT                    (13U)
#define MSCM_OCMDR_OCMT(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMT_SHIFT)) & MSCM_OCMDR_OCMT_MASK)
#define MSCM_OCMDR_RO_MASK                       (0x10000U)
#define MSCM_OCMDR_RO_SHIFT                      (16U)
#define MSCM_OCMDR_RO(x)                         (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_RO_SHIFT)) & MSCM_OCMDR_RO_MASK)
#define MSCM_OCMDR_OCMW_MASK                     (0xE0000U)
#define MSCM_OCMDR_OCMW_SHIFT                    (17U)
#define MSCM_OCMDR_OCMW(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMW_SHIFT)) & MSCM_OCMDR_OCMW_MASK)
#define MSCM_OCMDR_OCMSZ_MASK                    (0xF000000U)
#define MSCM_OCMDR_OCMSZ_SHIFT                   (24U)
#define MSCM_OCMDR_OCMSZ(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMSZ_SHIFT)) & MSCM_OCMDR_OCMSZ_MASK)
#define MSCM_OCMDR_OCMSZH_MASK                   (0x10000000U)
#define MSCM_OCMDR_OCMSZH_SHIFT                  (28U)
#define MSCM_OCMDR_OCMSZH(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMSZH_SHIFT)) & MSCM_OCMDR_OCMSZH_MASK)
#define MSCM_OCMDR_V_MASK                        (0x80000000U)
#define MSCM_OCMDR_V_SHIFT                       (31U)
#define MSCM_OCMDR_V(x)                          (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_V_SHIFT)) & MSCM_OCMDR_V_MASK)

/* The count of MSCM_OCMDR */
#define MSCM_OCMDR_COUNT                         (3U)


/*!
 * @}
 */ /* end of group MSCM_Register_Masks */


/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#define MSCM_BASE                                (0x40001000u)
/** Peripheral MSCM base pointer */
#define MSCM                                     ((MSCM_Type *)MSCM_BASE)
/** Array initializer of MSCM peripheral base addresses */
#define MSCM_BASE_ADDRS                          { MSCM_BASE }
/** Array initializer of MSCM peripheral base pointers */
#define MSCM_BASE_PTRS                           { MSCM }

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MTB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTB_Peripheral_Access_Layer MTB Peripheral Access Layer
 * @{
 */

/** MTB - Register Layout Typedef */
typedef struct {
  __IO uint32_t POSITION;                          /**< MTB Position Register, offset: 0x0 */
  __IO uint32_t MASTER;                            /**< MTB Master Register, offset: 0x4 */
  __IO uint32_t FLOW;                              /**< MTB Flow Register, offset: 0x8 */
  __I  uint32_t BASE;                              /**< MTB Base Register, offset: 0xC */
       uint8_t RESERVED_0[3824];
  __I  uint32_t MODECTRL;                          /**< Integration Mode Control Register, offset: 0xF00 */
       uint8_t RESERVED_1[156];
  __I  uint32_t TAGSET;                            /**< Claim TAG Set Register, offset: 0xFA0 */
  __I  uint32_t TAGCLEAR;                          /**< Claim TAG Clear Register, offset: 0xFA4 */
       uint8_t RESERVED_2[8];
  __I  uint32_t LOCKACCESS;                        /**< Lock Access Register, offset: 0xFB0 */
  __I  uint32_t LOCKSTAT;                          /**< Lock Status Register, offset: 0xFB4 */
  __I  uint32_t AUTHSTAT;                          /**< Authentication Status Register, offset: 0xFB8 */
  __I  uint32_t DEVICEARCH;                        /**< Device Architecture Register, offset: 0xFBC */
       uint8_t RESERVED_3[8];
  __I  uint32_t DEVICECFG;                         /**< Device Configuration Register, offset: 0xFC8 */
  __I  uint32_t DEVICETYPID;                       /**< Device Type Identifier Register, offset: 0xFCC */
  __I  uint32_t PERIPHID[8];                       /**< Peripheral ID Register, array offset: 0xFD0, array step: 0x4 */
  __I  uint32_t COMPID[4];                         /**< Component ID Register, array offset: 0xFF0, array step: 0x4 */
} MTB_Type;

/* ----------------------------------------------------------------------------
   -- MTB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTB_Register_Masks MTB Register Masks
 * @{
 */

/*! @name POSITION - MTB Position Register */
#define MTB_POSITION_WRAP_MASK                   (0x4U)
#define MTB_POSITION_WRAP_SHIFT                  (2U)
#define MTB_POSITION_WRAP(x)                     (((uint32_t)(((uint32_t)(x)) << MTB_POSITION_WRAP_SHIFT)) & MTB_POSITION_WRAP_MASK)
#define MTB_POSITION_POINTER_MASK                (0xFFFFFFF8U)
#define MTB_POSITION_POINTER_SHIFT               (3U)
#define MTB_POSITION_POINTER(x)                  (((uint32_t)(((uint32_t)(x)) << MTB_POSITION_POINTER_SHIFT)) & MTB_POSITION_POINTER_MASK)

