flit/argon-rtos/test/kinetis/devices/MKL28T7/MKL28T7_CORE0.h
/*! @name HWCFG3 - Hardware Configuration Register 3 */
#define XRDC_HWCFG3_PIDP32_MASK                  (0x1U)
#define XRDC_HWCFG3_PIDP32_SHIFT                 (0U)
#define XRDC_HWCFG3_PIDP32(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP32_SHIFT)) & XRDC_HWCFG3_PIDP32_MASK)
#define XRDC_HWCFG3_PIDP33_MASK                  (0x2U)
#define XRDC_HWCFG3_PIDP33_SHIFT                 (1U)
#define XRDC_HWCFG3_PIDP33(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP33_SHIFT)) & XRDC_HWCFG3_PIDP33_MASK)
#define XRDC_HWCFG3_PIDP34_MASK                  (0x4U)
#define XRDC_HWCFG3_PIDP34_SHIFT                 (2U)
#define XRDC_HWCFG3_PIDP34(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP34_SHIFT)) & XRDC_HWCFG3_PIDP34_MASK)
#define XRDC_HWCFG3_PIDP35_MASK                  (0x8U)
#define XRDC_HWCFG3_PIDP35_SHIFT                 (3U)
#define XRDC_HWCFG3_PIDP35(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP35_SHIFT)) & XRDC_HWCFG3_PIDP35_MASK)
#define XRDC_HWCFG3_PIDP36_MASK                  (0x10U)
#define XRDC_HWCFG3_PIDP36_SHIFT                 (4U)
#define XRDC_HWCFG3_PIDP36(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP36_SHIFT)) & XRDC_HWCFG3_PIDP36_MASK)
#define XRDC_HWCFG3_PIDP37_MASK                  (0x20U)
#define XRDC_HWCFG3_PIDP37_SHIFT                 (5U)
#define XRDC_HWCFG3_PIDP37(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP37_SHIFT)) & XRDC_HWCFG3_PIDP37_MASK)
#define XRDC_HWCFG3_PIDP38_MASK                  (0x40U)
#define XRDC_HWCFG3_PIDP38_SHIFT                 (6U)
#define XRDC_HWCFG3_PIDP38(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP38_SHIFT)) & XRDC_HWCFG3_PIDP38_MASK)
#define XRDC_HWCFG3_PIDP39_MASK                  (0x80U)
#define XRDC_HWCFG3_PIDP39_SHIFT                 (7U)
#define XRDC_HWCFG3_PIDP39(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP39_SHIFT)) & XRDC_HWCFG3_PIDP39_MASK)
#define XRDC_HWCFG3_PIDP40_MASK                  (0x100U)
#define XRDC_HWCFG3_PIDP40_SHIFT                 (8U)
#define XRDC_HWCFG3_PIDP40(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP40_SHIFT)) & XRDC_HWCFG3_PIDP40_MASK)
#define XRDC_HWCFG3_PIDP41_MASK                  (0x200U)
#define XRDC_HWCFG3_PIDP41_SHIFT                 (9U)
#define XRDC_HWCFG3_PIDP41(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP41_SHIFT)) & XRDC_HWCFG3_PIDP41_MASK)
#define XRDC_HWCFG3_PIDP42_MASK                  (0x400U)
#define XRDC_HWCFG3_PIDP42_SHIFT                 (10U)
#define XRDC_HWCFG3_PIDP42(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP42_SHIFT)) & XRDC_HWCFG3_PIDP42_MASK)
#define XRDC_HWCFG3_PIDP43_MASK                  (0x800U)
#define XRDC_HWCFG3_PIDP43_SHIFT                 (11U)
#define XRDC_HWCFG3_PIDP43(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP43_SHIFT)) & XRDC_HWCFG3_PIDP43_MASK)
#define XRDC_HWCFG3_PIDP44_MASK                  (0x1000U)
#define XRDC_HWCFG3_PIDP44_SHIFT                 (12U)
#define XRDC_HWCFG3_PIDP44(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP44_SHIFT)) & XRDC_HWCFG3_PIDP44_MASK)
#define XRDC_HWCFG3_PIDP45_MASK                  (0x2000U)
#define XRDC_HWCFG3_PIDP45_SHIFT                 (13U)
#define XRDC_HWCFG3_PIDP45(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP45_SHIFT)) & XRDC_HWCFG3_PIDP45_MASK)
#define XRDC_HWCFG3_PIDP46_MASK                  (0x4000U)
#define XRDC_HWCFG3_PIDP46_SHIFT                 (14U)
#define XRDC_HWCFG3_PIDP46(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP46_SHIFT)) & XRDC_HWCFG3_PIDP46_MASK)
#define XRDC_HWCFG3_PIDP47_MASK                  (0x8000U)
#define XRDC_HWCFG3_PIDP47_SHIFT                 (15U)
#define XRDC_HWCFG3_PIDP47(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP47_SHIFT)) & XRDC_HWCFG3_PIDP47_MASK)
#define XRDC_HWCFG3_PIDP48_MASK                  (0x10000U)
#define XRDC_HWCFG3_PIDP48_SHIFT                 (16U)
#define XRDC_HWCFG3_PIDP48(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP48_SHIFT)) & XRDC_HWCFG3_PIDP48_MASK)
#define XRDC_HWCFG3_PIDP49_MASK                  (0x20000U)
#define XRDC_HWCFG3_PIDP49_SHIFT                 (17U)
#define XRDC_HWCFG3_PIDP49(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP49_SHIFT)) & XRDC_HWCFG3_PIDP49_MASK)
#define XRDC_HWCFG3_PIDP50_MASK                  (0x40000U)
#define XRDC_HWCFG3_PIDP50_SHIFT                 (18U)
#define XRDC_HWCFG3_PIDP50(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP50_SHIFT)) & XRDC_HWCFG3_PIDP50_MASK)
#define XRDC_HWCFG3_PIDP51_MASK                  (0x80000U)
#define XRDC_HWCFG3_PIDP51_SHIFT                 (19U)
#define XRDC_HWCFG3_PIDP51(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP51_SHIFT)) & XRDC_HWCFG3_PIDP51_MASK)
#define XRDC_HWCFG3_PIDP52_MASK                  (0x100000U)
#define XRDC_HWCFG3_PIDP52_SHIFT                 (20U)
#define XRDC_HWCFG3_PIDP52(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP52_SHIFT)) & XRDC_HWCFG3_PIDP52_MASK)
#define XRDC_HWCFG3_PIDP53_MASK                  (0x200000U)
#define XRDC_HWCFG3_PIDP53_SHIFT                 (21U)
#define XRDC_HWCFG3_PIDP53(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP53_SHIFT)) & XRDC_HWCFG3_PIDP53_MASK)
#define XRDC_HWCFG3_PIDP54_MASK                  (0x400000U)
#define XRDC_HWCFG3_PIDP54_SHIFT                 (22U)
#define XRDC_HWCFG3_PIDP54(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP54_SHIFT)) & XRDC_HWCFG3_PIDP54_MASK)
#define XRDC_HWCFG3_PIDP55_MASK                  (0x800000U)
#define XRDC_HWCFG3_PIDP55_SHIFT                 (23U)
#define XRDC_HWCFG3_PIDP55(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP55_SHIFT)) & XRDC_HWCFG3_PIDP55_MASK)
#define XRDC_HWCFG3_PIDP56_MASK                  (0x1000000U)
#define XRDC_HWCFG3_PIDP56_SHIFT                 (24U)
#define XRDC_HWCFG3_PIDP56(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP56_SHIFT)) & XRDC_HWCFG3_PIDP56_MASK)
#define XRDC_HWCFG3_PIDP57_MASK                  (0x2000000U)
#define XRDC_HWCFG3_PIDP57_SHIFT                 (25U)
#define XRDC_HWCFG3_PIDP57(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP57_SHIFT)) & XRDC_HWCFG3_PIDP57_MASK)
#define XRDC_HWCFG3_PIDP58_MASK                  (0x4000000U)
#define XRDC_HWCFG3_PIDP58_SHIFT                 (26U)
#define XRDC_HWCFG3_PIDP58(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP58_SHIFT)) & XRDC_HWCFG3_PIDP58_MASK)
#define XRDC_HWCFG3_PIDP59_MASK                  (0x8000000U)
#define XRDC_HWCFG3_PIDP59_SHIFT                 (27U)
#define XRDC_HWCFG3_PIDP59(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP59_SHIFT)) & XRDC_HWCFG3_PIDP59_MASK)
#define XRDC_HWCFG3_PIDP60_MASK                  (0x10000000U)
#define XRDC_HWCFG3_PIDP60_SHIFT                 (28U)
#define XRDC_HWCFG3_PIDP60(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP60_SHIFT)) & XRDC_HWCFG3_PIDP60_MASK)
#define XRDC_HWCFG3_PIDP61_MASK                  (0x20000000U)
#define XRDC_HWCFG3_PIDP61_SHIFT                 (29U)
#define XRDC_HWCFG3_PIDP61(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP61_SHIFT)) & XRDC_HWCFG3_PIDP61_MASK)
#define XRDC_HWCFG3_PIDP62_MASK                  (0x40000000U)
#define XRDC_HWCFG3_PIDP62_SHIFT                 (30U)
#define XRDC_HWCFG3_PIDP62(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP62_SHIFT)) & XRDC_HWCFG3_PIDP62_MASK)
#define XRDC_HWCFG3_PIDP63_MASK                  (0x80000000U)
#define XRDC_HWCFG3_PIDP63_SHIFT                 (31U)
#define XRDC_HWCFG3_PIDP63(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP63_SHIFT)) & XRDC_HWCFG3_PIDP63_MASK)

/*! @name MDACFG - Master Domain Assignment Configuration Register */
#define XRDC_MDACFG_NMDAR_MASK                   (0xFU)
#define XRDC_MDACFG_NMDAR_SHIFT                  (0U)
#define XRDC_MDACFG_NMDAR(x)                     (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NMDAR_SHIFT)) & XRDC_MDACFG_NMDAR_MASK)
#define XRDC_MDACFG_NCM_MASK                     (0x80U)
#define XRDC_MDACFG_NCM_SHIFT                    (7U)
#define XRDC_MDACFG_NCM(x)                       (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NCM_SHIFT)) & XRDC_MDACFG_NCM_MASK)

