flit/argon-rtos/test/kinetis/devices/MKL28T7/MKL28T7_CORE0.h
/*! @name MRGD_W - Memory Region Descriptor W0..Memory Region Descriptor W7 */
#define XRDC_MRGD_W_SRD_MASK                     (0xFFU)
#define XRDC_MRGD_W_SRD_SHIFT                    (0U)
#define XRDC_MRGD_W_SRD(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_SRD_SHIFT)) & XRDC_MRGD_W_SRD_MASK)
#define XRDC_MRGD_W_D8ACP_MASK                   (0x7U)
#define XRDC_MRGD_W_D8ACP_SHIFT                  (0U)
#define XRDC_MRGD_W_D8ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D8ACP_SHIFT)) & XRDC_MRGD_W_D8ACP_MASK)
#define XRDC_MRGD_W_D0ACP_MASK                   (0x7U)
#define XRDC_MRGD_W_D0ACP_SHIFT                  (0U)
#define XRDC_MRGD_W_D0ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D0ACP_SHIFT)) & XRDC_MRGD_W_D0ACP_MASK)
#define XRDC_MRGD_W_D1ACP_MASK                   (0x38U)
#define XRDC_MRGD_W_D1ACP_SHIFT                  (3U)
#define XRDC_MRGD_W_D1ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D1ACP_SHIFT)) & XRDC_MRGD_W_D1ACP_MASK)
#define XRDC_MRGD_W_D9ACP_MASK                   (0x38U)
#define XRDC_MRGD_W_D9ACP_SHIFT                  (3U)
#define XRDC_MRGD_W_D9ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D9ACP_SHIFT)) & XRDC_MRGD_W_D9ACP_MASK)
#define XRDC_MRGD_W_BASEADDR_MASK                (0xFFFFFFE0U)
#define XRDC_MRGD_W_BASEADDR_SHIFT               (5U)
#define XRDC_MRGD_W_BASEADDR(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_BASEADDR_SHIFT)) & XRDC_MRGD_W_BASEADDR_MASK)
#define XRDC_MRGD_W_D2ACP_MASK                   (0x1C0U)
#define XRDC_MRGD_W_D2ACP_SHIFT                  (6U)
#define XRDC_MRGD_W_D2ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D2ACP_SHIFT)) & XRDC_MRGD_W_D2ACP_MASK)
#define XRDC_MRGD_W_D10ACP_MASK                  (0x1C0U)
#define XRDC_MRGD_W_D10ACP_SHIFT                 (6U)
#define XRDC_MRGD_W_D10ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D10ACP_SHIFT)) & XRDC_MRGD_W_D10ACP_MASK)
#define XRDC_MRGD_W_SZ_MASK                      (0x1F00U)
#define XRDC_MRGD_W_SZ_SHIFT                     (8U)
#define XRDC_MRGD_W_SZ(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_SZ_SHIFT)) & XRDC_MRGD_W_SZ_MASK)
#define XRDC_MRGD_W_D3ACP_MASK                   (0xE00U)
#define XRDC_MRGD_W_D3ACP_SHIFT                  (9U)
#define XRDC_MRGD_W_D3ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D3ACP_SHIFT)) & XRDC_MRGD_W_D3ACP_MASK)
#define XRDC_MRGD_W_D11ACP_MASK                  (0xE00U)
#define XRDC_MRGD_W_D11ACP_SHIFT                 (9U)
#define XRDC_MRGD_W_D11ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D11ACP_SHIFT)) & XRDC_MRGD_W_D11ACP_MASK)
#define XRDC_MRGD_W_D12ACP_MASK                  (0x7000U)
#define XRDC_MRGD_W_D12ACP_SHIFT                 (12U)
#define XRDC_MRGD_W_D12ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D12ACP_SHIFT)) & XRDC_MRGD_W_D12ACP_MASK)
#define XRDC_MRGD_W_D4ACP_MASK                   (0x7000U)
#define XRDC_MRGD_W_D4ACP_SHIFT                  (12U)
#define XRDC_MRGD_W_D4ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D4ACP_SHIFT)) & XRDC_MRGD_W_D4ACP_MASK)
#define XRDC_MRGD_W_D5ACP_MASK                   (0x38000U)
#define XRDC_MRGD_W_D5ACP_SHIFT                  (15U)
#define XRDC_MRGD_W_D5ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D5ACP_SHIFT)) & XRDC_MRGD_W_D5ACP_MASK)
#define XRDC_MRGD_W_D13ACP_MASK                  (0x38000U)
#define XRDC_MRGD_W_D13ACP_SHIFT                 (15U)
#define XRDC_MRGD_W_D13ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D13ACP_SHIFT)) & XRDC_MRGD_W_D13ACP_MASK)
#define XRDC_MRGD_W_D6ACP_MASK                   (0x1C0000U)
#define XRDC_MRGD_W_D6ACP_SHIFT                  (18U)
#define XRDC_MRGD_W_D6ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D6ACP_SHIFT)) & XRDC_MRGD_W_D6ACP_MASK)
#define XRDC_MRGD_W_D14ACP_MASK                  (0x1C0000U)
#define XRDC_MRGD_W_D14ACP_SHIFT                 (18U)
#define XRDC_MRGD_W_D14ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D14ACP_SHIFT)) & XRDC_MRGD_W_D14ACP_MASK)
#define XRDC_MRGD_W_D15ACP_MASK                  (0xE00000U)
#define XRDC_MRGD_W_D15ACP_SHIFT                 (21U)
#define XRDC_MRGD_W_D15ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D15ACP_SHIFT)) & XRDC_MRGD_W_D15ACP_MASK)
#define XRDC_MRGD_W_D7ACP_MASK                   (0xE00000U)
#define XRDC_MRGD_W_D7ACP_SHIFT                  (21U)
#define XRDC_MRGD_W_D7ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_D7ACP_SHIFT)) & XRDC_MRGD_W_D7ACP_MASK)
#define XRDC_MRGD_W_SNUM_MASK                    (0x3F000000U)
#define XRDC_MRGD_W_SNUM_SHIFT                   (24U)
#define XRDC_MRGD_W_SNUM(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_SNUM_SHIFT)) & XRDC_MRGD_W_SNUM_MASK)
#define XRDC_MRGD_W_LK2_MASK                     (0x60000000U)
#define XRDC_MRGD_W_LK2_SHIFT                    (29U)
#define XRDC_MRGD_W_LK2(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_LK2_SHIFT)) & XRDC_MRGD_W_LK2_MASK)
#define XRDC_MRGD_W_SE_MASK                      (0x40000000U)
#define XRDC_MRGD_W_SE_SHIFT                     (30U)
#define XRDC_MRGD_W_SE(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_SE_SHIFT)) & XRDC_MRGD_W_SE_MASK)
#define XRDC_MRGD_W_VLD_MASK                     (0x80000000U)
#define XRDC_MRGD_W_VLD_SHIFT                    (31U)
#define XRDC_MRGD_W_VLD(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_MRGD_W_VLD_SHIFT)) & XRDC_MRGD_W_VLD_MASK)

/* The count of XRDC_MRGD_W */
#define XRDC_MRGD_W_COUNT                        (24U)

/* The count of XRDC_MRGD_W */
#define XRDC_MRGD_W_COUNT2                       (8U)


/*!
 * @}
 */ /* end of group XRDC_Register_Masks */


/* XRDC - Peripheral instance base addresses */
/** Peripheral XRDC base address */
#define XRDC_BASE                                (0x40014000u)
/** Peripheral XRDC base pointer */
#define XRDC                                     ((XRDC_Type *)XRDC_BASE)
/** Array initializer of XRDC peripheral base addresses */
#define XRDC_BASE_ADDRS                          { XRDC_BASE }
/** Array initializer of XRDC peripheral base pointers */
#define XRDC_BASE_PTRS                           { XRDC }

/*!
 * @}
 */ /* end of group XRDC_Peripheral_Access_Layer */


